app/controllers/prototypes_controller.rb

SELECT `prototypes`.* FROM `prototypes`
---
  def index
    @prototypes = Prototype.includes(:user)

INSERT INTO `prototypes` (`title`, `catch_copy`, `concept`, `user_id`, `created_at`, `updated_at`) VALUES ('abc', 'abcabc', 'abcabcabc', 1, '2021-08-16 01:19:39.117058', '2021-08-16 01:19:39.117058')
---
  def create
     @prototype = Prototype.new(prototype_params)
    if @prototype.save

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 12 LIMIT 1
---
  def edit
     @prototype = Prototype.find(params[:id])

UPDATE `prototypes` SET `prototypes`.`title` = 'sss', `prototypes`.`updated_at` = '2021-08-13 05:05:54.310008' WHERE `prototypes`.`id` = 13
---
  def update
    if @prototype.update(prototype_params)

DELETE FROM `prototypes` WHERE `prototypes`.`id` = 13
---
  def destroy
    if @prototype.destroy

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1
---
  def set_prototype
    @prototype = Prototype.find(params[id])