app/controllers/users_controller.rb

  def show
    #@user = User.new(user_params)
    @user = User.find(params[:id])
    @prototypes = Prototype.all
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`user_id` = 1